Revit 2026 API

# SelectionFilterElementAddSingle Method

---

Adds a single ElementId to the filter's set.

**Namespace:** Autodesk.Revit.DB**Assembly:** RevitAPI (in RevitAPI.dll) Version: 26.0.4.0 (26.0.4.0)

```csharp
public void AddSingle(
	ElementId id
)
```
```vb
Public Sub AddSingle (
	id As ElementId
)
```
```cpp
public:
void AddSingle(
	ElementId^ id
)
```
```fsharp
member AddSingle :
        id : ElementId -> unit
```

#### Parameters

id ElementId
     The ElementId to add.

| Exception | Condition |
| --- | --- |
| ArgumentException | Invalid ElementId |
| ArgumentNullException | A non-optional argument was null |

#### Reference

SelectionFilterElement Class

Autodesk.Revit.DB Namespace